Tekla Open API Reference for Tekla Structures 2025
AABB.Addition Operator (Point, AABB)
 Adds the given point to the given axis-aligned 3d bounding box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static AABB operator +(
	Point Point,
	AABB AABB
)
Public Shared Operator + (
	Point As Point,
	AABB As AABB
) As AABB
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be added.
AABB
Type: Tekla.Structures.Geometry3d.AABB
The axis-aligned 3d bounding box to add to.
Return Value
Type: AABB
The new axis-aligned 3d bounding box which includes the given axis-aligned 3d bounding box and the given point.
See Also
Reference
AABB Class
Addition Overload
Tekla.Structures.Geometry3d Namespace